OpenFOAM-v1712/tutorials/combustion/fireFoam/LES/compartmentFire/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel  eddyDissipationDiffusionModel<psiThermoCombustion,gasHThermoPhysics>;

active  on;

eddyDissipationDiffusionModelCoeffs
{
    semiImplicit    false;
    CEDC            4;
    Cd              4;
}

infinitelyFastChemistryCoeffs
{
    semiImplicit no;
    C       5.0;
}

// ************************************************************************* //
