OpenFOAM-v1712/tutorials/combustion/fireFoam/LES/compartmentFire/system/panelRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default        none;
}

laplacianSchemes
{
	 default none;
	//laplacian(K,T) Gauss linear uncorrected;
	laplacian(kappa,T) Gauss harmonic uncorrected;
	laplacian(thermo:alpha,h) Gauss harmonic uncorrected;
}

interpolationSchemes
{
 	default linear;
	//default none;
}

snGradSchemes
{
    default        uncorrected;
}


// ************************************************************************* //
