OpenFOAM-v1712/tutorials/combustion/fireFoam/LES/compartmentFire/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    slot_bottom;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.201 -0.001 -0.201)(-0.199 0.031 0.201);
        }
    }

    {
        name    slot_bottom;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet slot_bottom;
        }
    }
    {
        name    slot_top;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.201 0.369 -0.201)(-0.199 0.401 0.201);
        }
    }

    {
        name    slot_top;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet slot_top;
        }
    }

    {
        name    inletFace;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
           name inlet;
        }
    }

    {
        name    compartment_fire;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.201 -0.001 -0.201)(0.201 0.401 0.201);
        }
    }

    {
        name    compartment_fire;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set compartment_fire;
        }
    }

    {
        name    internalWallPanel;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.2001 0.0301 -0.2001)(-0.1999 0.3701 0.2001);
        }
    }

    {
        name    internalWallPanel;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet internalWallPanel;
        }
    }

    {
        name    wallFaces_back;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.2001 -0.0001 -0.2001)(0.2001 0.4001 -0.1999);
        }
    }

{
        name    wallFaces_front;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.2001 -0.0001 0.1999)(0.2001 0.4001 0.2001);
        }
    }

    {
        name    wallFaces_top;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.2001 0.3999 -0.2001)(0.2001 0.4001 0.2001);
        }
    }

    {
        name    wallFaces_side;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.1999 -0.0001 -0.2001)(0.2001 0.4001 0.2001);
        }
    }

    {
        name    wallPanel;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet wallFaces_back;
        }
    }

    {
        name    wallPanel;
        type    faceZoneSet;
        action  add;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet wallFaces_front;
        }
    }

    {
        name    wallPanel;
        type    faceZoneSet;
        action  add;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet wallFaces_top;
        }
    }

    {
        name    wallPanel;
        type    faceZoneSet;
        action  add;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet wallFaces_side;
        }
    }

    {
        name    baseFace;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.2001 -0.001 -0.2001)(0.2001 0.001 0.2001);
        }
    }

    {
        name    wallPanel;
        type    faceZoneSet;
        action  add;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet baseFace;
        }
    }

    {
        name    wallPanel;
        type    faceZoneSet;
        action  delete;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet inletFace;
        }
    }






);

// ************************************************************************* //
